try: # check if they were installed
    import matplotlib.pyplot as plt
    import matplotlib
    import numpy as np
except Exception:
    import os
    os.system('pip install matplotlib; pip install numpy')
    import matplotlib.pyplot as plt
    import matplotlib
    import numpy as np


matplotlib.rcParams['font.sans-serif'] = ['KaiTi'] # 让这玩意能正常显示中文
matplotlib.rcParams['font.serif'] = ['KaiTi']


def draw_pic(datas:dict[str,np.array]) -> None:
    name = f'单缝衍射_{datas[0]["name"]}'

    plt.plot(datas[0]['X'][0],datas[0]['P'][0],'r-',)
    plt.title(name)
    plt.xlabel('X/mm')
    plt.ylabel('P/μW')
    plt.legend()
    # plt.show()
    plt.savefig(f'{name}.png')
    plt.clf()

def main():
    datas = {
        "X":[
            np.array([
                34.050, 34.297, 34.543, 34.790, 35.036, 35.283, 35.529, 35.776, 36.022, 36.269, 36.515,
                36.760, 37.020, 37.280, 37.540, 37.800, 38.060, 38.321, 38.581, 38.841, 39.101, 39.361,
                39.623, 39.877, 40.131, 40.386, 40.640, 40.894, 41.148, 41.402, 41.656, 41.911, 42.165,
                42.419, 42.676, 42.932, 43.189, 43.446, 43.702, 43.959, 44.215, 44.472, 44.729, 44.985,
                45.242,
            ]),
        ],
        "P":[
            np.array([
                0.2,0.3,0.5,0.9,1.2,1.5,1.8,1.8,1.6,1.2,0.5,
                0.3,0.5,1.3,4.2,7.0,11.0,15.6,21.0,25.2,31.0,33.8,
                35.3,34.1,31.8,28.4,23.9,18.2,13.8,7.8,4.1,2.6,1.0,
                0.3,0.5,0.8,1.3,1.8,1.8,1.6,1.2,0.9,0.4,0.3,
                0.2,
            ]),
        ],
        "name":'0.2mm',
    },
    draw_pic(datas)

    datas1 = {
        "X":[
            np.array([
                33.942, 34.260, 34.578, 34.896, 35.214, 35.532, 35.850, 36.168, 36.486, 36.804, 37.122,
                37.440, 37.638, 37.837, 38.035, 38.234, 38.432, 38.631, 38.829, 39.028, 39.226, 39.425,
                39.623, 39.759, 39.896, 40.032, 40.168, 40.305, 40.441, 40.578, 40.714, 40.850, 40.987,
                41.123, 41.298, 41.473, 41.648, 41.823, 41.998, 42.172, 42.347, 42.522, 42.697, 42.872,
                43.047,
            ]),
        ],
        "P":[
            np.array([
                0.3,0.5,1.1,1.3,0.9,0.5,0.4,1.1,2.7,3.8,2.5,
                0.8,1.1,5.7,11.8,18.8,28.7,41.5,54.6,74.0,76.9,77.1,
                75.6,70.8,68.5,61.1,53.4,43.5,32.9,24.3,16.8,9.3,4.4,
                0.8,0.8,1.1,1.6,2.9,3.4,3.8,3.6,2.9,1.8,0.8,
                0.3,
            ]),
        ],
        "name":'0.3mm',
    },
    draw_pic(datas1)

if __name__ == '__main__':
    main()